Documents/СчетНаЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СчетНаЗаказ</Name>
			<BasedOn>
				<xr:Item>Document.НарядЗаказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорияУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьВыполняемыхРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Работа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единицы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Единицы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетНаЗаказ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция КатегорияПриИзмененииНаСервере(Категория)
	ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
	Если ТипЗнч(ЦенаКатегории) = Тип("Булево") Тогда
		РегистрСведенийСоздание.СоздатьРегистр(Категория);
		ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
	КонецЕсли;
	Возврат ЦенаКатегории;
КонецФункции

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ЦенаКатегории = КатегорияПриИзмененииНаСервере(Объект.Категория);
	Для каждого Строка из Объект.ПереченьВыполняемыхРабот Цикл
		Строка.Цена = ЦенаКатегории;
		Строка.Стоимость = Строка.Цена * Строка.Количество;
	КонецЦикла;
КонецПроцедуры
